{
  "@context": "https://schema.org/",
  "@type": "Recipe",
  "suitableForDiet": "https://schema.org/VeganDiet",
  "name": "Homemade Artisan Bread",
  "description": "Even if you've never made homemade bread or worked with yeast before, this homemade artisan bread is for you.",
  "author": { "@type": "Person", "name": "Sally" },
  "keywords": "bread, loaf",
  "image": [
    "https://cdn.sallysbakingaddiction.com/wp-content/uploads/2019/12/homemade-artisan-bread.jpg"
  ],
  "url": "https://sallysbakingaddiction.com/homemade-artisan-bread/",
  "recipeIngredient": [
    "3 and 1/4 cups (420g) bread flour (spoon & leveled), plus more for hands and pan",
    "2 teaspoons instant yeast",
    "2 teaspoons coarse salt (see note)",
    "1 and 1/2 cups (360ml) cool water",
    "optional: cornmeal for dusting pan"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "In a large un-greased mixing bowl, whisk the flour, yeast, and salt together. Pour in the cool water and gently mix together with a rubber spatula or wooden spoon. The dough will seem dry and shaggy, but keep working it until all the flour is moistened. If needed, use your hands (as I do in the video tutorial above) to work the dough ingredients together. The dough will be sticky. Shape into a ball in the bowl as best you can."
    },
    {
      "@type": "HowToStep",
      "text": "Cover the dough tightly with plastic wrap or aluminum foil and set on the counter at room temperature (honestly any normal room temperature is fine!). Allow to rise for 2-3 hours. The dough will just about double in size, stick to the sides of the bowl, and have a lot of air bubbles."
    },
    {
      "@type": "HowToStep",
      "text": "You can continue with step 4 immediately, but for absolute best flavor and texture, I strongly recommend letting this risen dough rest in the refrigerator for at least 12 hours and up to 3 days. Place covered dough in the refrigerator for 12 hours – 3 days. I usually let it rest in the refrigerator for about 18 hours. The dough will puff up during this time, but may begin to deflate after 2 days. That’s fine and normal– nothing to worry about."
    },
    {
      "@type": "HowToStep",
      "text": "Lightly dust a large nonstick baking sheet (with or without rims and make sure it’s nonstick) with flour and/or cornmeal. Turn the cold dough out onto a floured work surface. Using a sharp knife or bench scraper, cut dough in half. Some air bubbles will deflate as you work with it. Place dough halves on prepared baking sheet. Using floured hands, shape into 2 long loaves about 9×3 inches each (doesn’t have to be exact) about 3 inches apart. Loosely cover and allow to rest for 45 minutes. You will bake the dough on this prepared baking sheet. See recipe note if you want to use a pizza stone."
    },
    {
      "@type": "HowToStep",
      "text": "During this 45 minutes, preheat the oven to 475°F (246°C)."
    },
    {
      "@type": "HowToStep",
      "text": "When ready to bake, using a very sharp knife or bread lame (some even use kitchen shears), score the bread loaves with 3 slashes, about 1/2 inch deep. (“Score” = shallow cut.) If the shaped loaves flattened out during the 45 minutes, use floured hands to narrow them out along the sides again."
    },
    {
      "@type": "HowToStep",
      "text": "Optional for a slightly crispier crust: After the oven is preheated and bread is scored, place a shallow metal or cast iron baking pan or skillet (I usually use a metal 9×13 baking pan) on the bottom oven rack. Carefully and quickly pour 3-4 cups of boiling water into it. Place the scored dough/baking pan on a higher rack and quickly shut the oven, trapping the steam inside. The steam helps create a crispier crust."
    },
    {
      "@type": "HowToStep",
      "text": "Place the shaped and scored dough (on the flour/cornmeal dusted pan) in the preheated oven on the center rack. Bake for 20-25 minutes or until the crust is golden brown. Gently tap the loaves– if they sound hollow, the bread is done."
    },
    {
      "@type": "HowToStep",
      "text": "Remove the bread from the oven and allow to cool for at least 5 minutes before slicing and serving. Store leftovers loosely covered at room temperature for up to 5 days or in the refrigerator for up to 10 days."
    }
  ],
  "prepTime": "PT4H",
  "cookTime": "PT25M",
  "totalTime": "PT4H25M",
  "recipeYield": "2 8-inch loaves",
  "recipeCategory": "Bread",
  "cookingMethod": "Baking",
  "recipeCuisine": "American",
  "aggregateRating": {
    "@type": "AggregateRating",
    "reviewCount": "416",
    "ratingValue": "4.9"
  },
  "video": {
    "@context": "http://schema.org",
    "@type": "VideoObject",
    "name": "Homemade Artisan Bread",
    "description": "This super easy 4 ingredient homemade artisan bread is extra chewy, slightly crispy, and a soft and airy interior.",
    "contentUrl": "https://content.jwplatform.com/videos/yXQwx8l1.mp4",
    "thumbnailUrl": ["https://content.jwplatform.com/thumbs/yXQwx8l1-720.jpg"],
    "uploadDate": "2019-12-31"
  },
  "review": [
    {
      "@type": "Review",
      "reviewRating": { "@type": "Rating", "ratingValue": "5" },
      "author": { "@type": "Person", "name": "Pat" },
      "datePublished": "2020-05-19",
      "reviewBody": "Thank you so much for this recipe. Really easy! This was my first time ever, and it was great. My family loved it!"
    },
    {
      "@type": "Review",
      "reviewRating": { "@type": "Rating", "ratingValue": "5" },
      "author": { "@type": "Person", "name": "claudia e silbert" },
      "datePublished": "2020-05-23",
      "reviewBody": "USE A SILICONE SCRAPER TO MANIPULATE/KNEAD THE DOUGH AFTER RISING. ELIMINATES STICKYNESS PROBLEMS SINCE IT IS NONSTICK.  KITCHENAID MAKES A SET FOR $12 ON Amazon."
    },
    {
      "@type": "Review",
      "reviewRating": { "@type": "Rating", "ratingValue": "5" },
      "author": { "@type": "Person", "name": "Gretchen H Nelson" },
      "datePublished": "2020-05-21",
      "reviewBody": "I made this yesterday and it was my first time making Artisan bread. I only had regular flour and I followed the recipe to the letter. The dough came out a bit too thin so could not form it into two but used my newly purchased Bread bowl. It came out absolutely perfect!!  It was just delicious !!   My husband loved it. I will be making it again and again!! \r\nWonderful!!!"
    },
    {
      "@type": "Review",
      "reviewRating": { "@type": "Rating", "ratingValue": "5" },
      "author": { "@type": "Person", "name": "Fredi" },
      "datePublished": "2020-05-21",
      "reviewBody": "This bread was amazing! Why are people complaining about this AMAZING bread?"
    },
    {
      "@type": "Review",
      "reviewRating": { "@type": "Rating", "ratingValue": "5" },
      "author": { "@type": "Person", "name": "Beth" },
      "datePublished": "2020-05-21",
      "reviewBody": "This turned out great!  Thank you for sharing it."
    },
    {
      "@type": "Review",
      "reviewRating": { "@type": "Rating", "ratingValue": "5" },
      "author": { "@type": "Person", "name": "Junko" },
      "datePublished": "2020-05-22",
      "reviewBody": "I just made this bread today.  \r\nI added 3/4 cup dried cranberries and 1 cup of coarsely chopped walnuts to the dough.  I also used the water bath as described.  I made one big round-shaped bread and baked It for 33 minutes.  It turned out great!!  The outside is crisp, but the inside is so fluffy and moist.  My family really liked it!\r\nThanks for the great recipe!!"
    },
    {
      "@type": "Review",
      "reviewRating": { "@type": "Rating", "ratingValue": "5" },
      "author": { "@type": "Person", "name": "Hugo" },
      "datePublished": "2020-05-22",
      "reviewBody": "I adapted this recipe to make a chilli and garlic loaf by replacing the 2tsp of course salt with 1tsp of chilli salt and 1tsp of  Garlic salt - delicious!\r\n\r\nGreat recipe, great bread every time!"
    },
    {
      "@type": "Review",
      "reviewRating": { "@type": "Rating", "ratingValue": "3" },
      "author": { "@type": "Person", "name": "Anna Fisco" },
      "datePublished": "2020-05-24",
      "reviewBody": "I followed this recipe exactly.  When I took loaves out of oven , they were stuck to pan.\r\nCould not remove them without tearing the bread "
    }
  ],
  "datePublished": "2020-01-01",
  "sameAs": ["https://sallysbakingaddiction.com/homemade-artisan-bread/"]
}
