{
  "@type": "Recipe",
  "author": {
    "@type": "Person",
    "name": "Sarah Jampel"
  },
  "createdAt": "2020-10-08T05:48:10.394Z",
  "dateCreated": "2020-10-07T11:31:00.000-04:00",
  "datePublished": "2020-02-22T04:00:00.000-05:00",
  "description": "If you want to fill your kitchen with the smell of fresh-baked bread but you're nervous about shaping a boule or working with a starter, focaccia is the best place to begin. We're not exaggerating when we say it requires zero skill and provides ample opportunity to be amazed by yourself and by the wonders of yeast. ",
  "image": "https://assets.bonappetit.com/photos/5e504706e23a4f0008694627/16:9/w_1000,c_limit/BBaking_WEEK3_Focaccia2.jpg",
  "name": "Shockingly Easy No-Knead Focaccia",
  "nutrition": "",
  "publisher": {
    "@type": "Organization",
    "logo": {
      "@type": "ImageObject",
      "height": 56,
      "url": "https://www.bonappetit.com/images/logo-foodculture-tablet@1x.png",
      "width": 322
    },
    "name": "Bon Appétit"
  },
  "recipeIngredient": [
    "1 1/4 -oz. envelope active dry yeast (about 2 1/4 tsp.)",
    "2 tsp. honey",
    "5 cups (625 g) all-purpose flour",
    "5 tsp. Diamond Crystal or 1 Tbsp. Morton kosher salt",
    "6 Tbsp. extra-virgin olive oil, divided, plus more for hands",
    "4 Tbsp. unsalted butter, plus more for pan",
    "Flaky sea salt",
    "2–4 garlic cloves"
  ],
  "recipeInstructions": [
    {
      "@type": "HowToStep",
      "text": "Whisk one 1/4 -oz. envelope active dry yeast (about 2 1/4 tsp.), 2 tsp. honey, and 2 1/2 cups lukewarm water in a medium bowl and let sit 5 minutes (it should foam or at least get creamy; if it doesn’t your yeast is dead and you should start again—check the expiration date!)."
    },
    {
      "@type": "HowToStep",
      "text": "Add 5 cups (625 g) all-purpose flour and 5 tsp. Diamond Crystal or 1 Tbsp. Morton kosher salt and mix with a rubber spatula until a shaggy dough forms and no dry streaks remain."
    },
    {
      "@type": "HowToStep",
      "text": "Pour 4 Tbsp. extra-virgin olive oil into a big bowl that will fit in your refrigerator. This puppy is going to rise! Transfer dough to bowl and turn to coat in oil. Cover with a silicone lid or plastic wrap and chill until dough is doubled in size (it should look very bubbly and alive), at least 8 hours and up to 1 day. If you're in a rush, you can also let it rise at room temperature until doubled in size, 3–4 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Generously butter a 13x9\" baking pan, for thicker focaccia that’s perfect for sandwiches, or an 18x13\" rimmed baking sheet, for focaccia that's thinner, crispier, and great for snacking. The butter may seem superfluous, but it’ll ensure that your focaccia doesn’t stick. Pour 1 Tbsp. extra-virgin olive oil into center of pan. Keeping the dough in the bowl and using a fork in each hand, gather up edges of dough farthest from you and lift up and over into center of bowl. Give the bowl a quarter turn and repeat process. Do this 2 more times; you want to deflate dough while you form it into a rough ball. (We learned this technique from Alexandra Stafford, who uses it to shape her no-knead bread.) Transfer dough to prepared pan. Pour any oil left in bowl over and turn dough to coat it in oil. Let rise, uncovered, in a dry, warm spot (like near a radiator or on top of the fridge or a preheating oven) until doubled in size, at least 1 1/2 hours and up to 4 hours."
    },
    {
      "@type": "HowToStep",
      "text": "Place a rack in middle of oven; preheat to 450°. To see if the dough is ready, poke it with your finger. It should spring back slowly, leaving a small visible indentation. If it springs back quickly, the dough isn’t ready. (If at this point the dough is ready to bake but you aren’t, you can chill it up to 1 hour.) Lightly oil your hands. If using a rimmed baking sheet, gently stretch out dough to fill (you probably won't need to do this if using a baking pan). Dimple focaccia all over with your fingers, like you’re aggressively playing the piano, creating very deep depressions in the dough (reach your fingers all the way to the bottom of the pan). Drizzle with remaining 1 Tbsp. extra-virgin olive oil and sprinkle with flaky sea salt. Bake focaccia until puffed and golden brown all over, 20–30 minutes."
    },
    {
      "@type": "HowToStep",
      "text": "Hold off on this last step until you're ready to serve the focaccia: Melt 4 Tbsp. unsalted butter in a small saucepan over medium heat. Remove from heat. Peel and grate in 2–4 garlic cloves with a Microplane (use 2 cloves if you’re garlic-shy or up to 4 if you love it). Return to medium heat and cook, stirring often, until garlic is just lightly toasted, 30–45 seconds. (Or, if you prefer raw garlic to toasted garlic, you can grate the garlic into the hot butter, off heat, then brush right away.)."
    },
    {
      "@type": "HowToStep",
      "text": "Brush garlic-butter all over focaccia and slice into squares or rectangles."
    },
    {
      "@type": "HowToStep",
      "text": "Do Ahead: Focaccia is best eaten the day it's made, but keeps well in the freezer. Slice it into pieces, store it in a freezer-safe container, then reheat it on a baking sheet in a 300° F oven."
    }
  ],
  "recipeYield": "10–12 servings",
  "sameAs": ["https://www.bonappetit.com/recipe/easy-no-knead-focaccia"],
  "updatedAt": "2020-10-08T05:48:10.394Z"
}
